## 设置键的生存时间或过期时间   
通过EXPIRE命令或者PEXPIRE命令，客户端可以以秒或者毫秒精度为数据库中的某个键设置生存时间（Time To  Live, TTL），在经过指定的秒数或者毫秒数之后，服务器就会自动删除生存时间0的键：
```
redis>  SET key value
OK

redis> EXPIRE key 5
(integer) 1

redis>  GET key //5秒之内
"value"

redis>  GET key //5秒之后
(nil)
```
**如何查看一个键的剩余生存时间**？  
使用TTL，PTTL命令。
```
redis> SET key value
OK

redis> EXPIRE key 1000
(integer) 1

redis> TTL key
(integer) 997

redis> PTTL key
(integer) 93633
```
## 设置过期时间  
